import 'package:flutter/material.dart';

import '../Menu/menu_page.dart';

class AboutUsPage extends StatelessWidget {
  @override
  Widget build(BuildContext context) {

    return Scaffold(
      backgroundColor: Color.fromARGB(255, 244, 241, 234),
      appBar: AppBar(
        backgroundColor: Color.fromARGB(255, 54, 202, 218),
        centerTitle: true,
        title: Text("درباره ما",
            textAlign: TextAlign.center,
            textDirection: TextDirection.rtl,
            style: TextStyle(
                color: Colors.white,
                fontSize: 24,
                fontWeight: FontWeight.w600)),
        actions: <Widget>[
          IconButton(
            icon: const Icon(Icons.menu),
            onPressed: () {
              Navigator.push(
                context,
                MaterialPageRoute(builder: (context) => MenuPage()),
              );
            },
          ),
        ],
      ),
      body: SingleChildScrollView(
        child: Container(
          alignment: Alignment.center,
          margin: EdgeInsets.all(20),
          width: MediaQuery.of(context).size.width,
          child: Text('''
بِسْم الله الرحمن الرحيم

{ وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ الْقُرَى الَّتِي بَارَكْنَا فِيهَا قُرًى ظَاهِرَةً وَقَدَّرْنَا فِيهَا السَّيْرَ ۖ سِيرُوا فِيهَا لَيَالِيَ وَأَيَّامًا آمِنِينَ }   ( سورة سبأ - آية ١٨ )


ورد في  بحار الأنوار  :
( عن أبي عبد الله عليه السلام ،  قال : دخل الحسن البصري على محمد بن علي عليه السلام ، فقال له : 

[ يا أخا أهل البصرة بلغني أنك فسرت آية من كتاب الله على غير ما أنزلت ، فإن كنت فعلت فقد هلكت واستهلكت 

 قال : و ما هي جعلت فداك ؟ 

قال : قول الله عز وجل : { وَجَعَلْنَا بَيْنَهُمْ وَبَيْنَ الْقُرَى الَّتِي بَارَكْنَا فِيهَا قُرًى ظَاهِرَةً وَقَدَّرْنَا فِيهَا السَّيْرَ ۖ سِيرُوا فِيهَا لَيَالِيَ وَأَيَّامًا آمِنِينَ } ، ويحك كيف يجعل الله لقوم أماناً ، ومتاعهم يُسرف بمكة و المدينة و ما بينهما ؟ و ربما  أُخذ عبد أو قتل و فاتت نفسه ]

 ثم مكث ملياً، ثم أومأ بيده إلى صدره ، و قال :
 [ نحن القرى التي بارك الله فيها ، قال : جعلت فداك أوجدت  هذا في كتاب الله إن القرى رجال ؟

 قال : نعم قول الله عز وجل : { وَكَأَيِّن مِّن قَرْيَةٍ عَتَتْ عَنْ أَمْرِ رَبِّهَا وَرُسُلِهِ فَحَاسَبْنَاهَا حِسَابًا شَدِيدًا وَعَذَّبْنَاهَا عَذَابًا نُّكْرًا } ، فمن العاتي على الله عز وجل ؟ الحيطان و البيوت أم الرجال ؟ فقال : الرجال 

ثم قال : جعلت فداك زدني 

قال : قوله عز وجل في سورة يوسف عليه السلام: { وَاسْأَلِ الْقَرْيَةَ الَّتِي كُنَّا فِيهَا وَالْعِيرَ الَّتِي أَقْبَلْنَا فِيهَا } ؟ لمن أمروه أن يسأل ؟ القرية والعير أم الرجال ؟ 

فقال : جعلت فداك فأخبرني عن القرى الظاهرة قال : هم شيعتنا، يعني العلماء منهم . ]

على مدى السنوات و الأيام تلتقي أرواح بأجساد مختلفة ، في طريق الخدمة تحت راية التوحيد ، راية الولاية ، راية محمد و آل محمد  ،  راية الحق ، في السعي ليل نهار بالجهاد المستمر  ، بنشر كلمات علماء آل بيت الله صَلوات الله و سلامه عليهم .

بأحدث البرامج و التقنيات ، فنرى منهم من توج خدمته  بالكتب الالكترونيه ، و منه بقنوات اليوتيوب ، و منهم من تكفل في دعم هذه القنوات بماله لكي ينالوا الحظ الأوفر في رضا أئمة الهدى بالدنيا و شفاعتهم في يوم لا ينفع مال و لا بنون . 

و في هذا الحساب المتوج  ( براية الحق ) ، الذي هو مداد أعمال المحبين و الخدام في طريق علماء مدرسة جناب الشيخ  المعظم الأوحد أحمد بن زين الدين الأحسائي أعلى الله مقامهم الشريف ، الأصوليه ، الإمامية ،  الإثنى عشرية .

و كما لهذا الطريق الراقي بعلمائه و حِكمته و عِلمه ، أوجبنا البحث عن أحدث الطرق لنشر كلماتهم الشريفه ، و لكي تصل إلى الشرق و الغرب ، و تكون ذخراً لأجيال  المستقبل ، و لكي يستمر هذا العمل إلى ظهور مولانا الحجة بن الحسن صَلوات الله و سلامه عليه ، فقد أضفنا على هذا الطريق المحمدي الكتب الصوتيه ، لمكتبة مدرسة الشيخ الأوحد و علماء مدرسته الشريفة  .

 ففي هذا الحساب ( راية الحق ) ، تم ترجمة خطب علماء المدرسة المباركه إلى اللغات العالمية الأساسية ، منها اللغة الإنجليزية و الفارسية ، و أيضاً تم الاهتمام بإخواننا المؤمنين و المؤمنات ، بوضع لغة الإشارة ، للخطب التي خطبها علماء المدرسة على مدى سنوات .

و نشكر كل الحسابات و القنوات  التي عملت على إظهار  كنوز و درر علمائنا الأعلام بشكل راقي ، من فيديوات للخطب في اليوتيوب منها : 

Alihqaqy Elip 
استوديو الحسيني 

و حسابات الكتب الالكترونية : 
awhad.com

و كل للشكر للمؤمنات اللاتي دعمن هذا البرنامج و تبرعن له في سبيل الله تعالى ، و لولاهن ما تم هذا العمل بهذا المستوى الراقي .

و الشكر موصول لجناب الحاج  المصمم  عبد المجيد العباسي ، على جهاده العظيم ، في عمل هذا البرنامج بأعلى المواصفات و التقنيات الحديثه ، فجزاه الله عنا خير جزاء المحسنين .
هذا و صلى الله على محمد و آل محمد .
''',
              textAlign: TextAlign.right,
              textDirection: TextDirection.rtl,
              style: TextStyle(
                  color: Colors.black,
                  fontSize: 14)),
        ),
      ),
    );
  }

}
